Enums/ВерсииФорматовОбменаЧестногоЗнака.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВерсииФорматовОбменаЧестногоЗнака</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>v3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>v4</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВерсииФорматовОбменаЧестногоЗнака/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ЗначениеВерсииФормата(ВыбраннаяВерсия) Экспорт
	
	Если ВыбраннаяВерсия = Перечисления.ВерсииФорматовОбменаЧестногоЗнака.v3 Тогда
		Возврат "v3";
	ИначеЕсли ВыбраннаяВерсия = Перечисления.ВерсииФорматовОбменаЧестногоЗнака.v4 Тогда
		Возврат "v4";
	КонецЕсли;
	
	// Значение по умолчанию
	Возврат "v3";
	
КонецФункции // ЗначениеВерсииФормата()

#КонецОбласти

#КонецЕсли
